# EnergyAnalysisSurface Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface Class
Members See Also
---
Analytical surface. The collection of analytic openings belonging to this analytical parent surface
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class EnergyAnalysisSurface : Element
```

Visual Basic
---
```text
Public Class EnergyAnalysisSurface _
	Inherits Element
```

Visual C++
---
```text
public ref class EnergyAnalysisSurface : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Analysis..::..EnergyAnalysisSurface
# See Also
EnergyAnalysisSurface Members
Autodesk.Revit.DB.Analysis Namespace